---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarCouplerFailures.EngagementBiggerThanLengthWarning
source: html/71179097-aa4b-63e8-87a2-765ae08953aa.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarCouplerFailures.EngagementBiggerThanLengthWarning Property

This is used to post warning. The sum of bar engagements is greater than the total coupler length.

## Syntax (C#)
```csharp
public static FailureDefinitionId EngagementBiggerThanLengthWarning { get; }
```